lintel/qemu-ch32v/qemu-overlay/10.2.2/hw/riscv/ch32-stk-pfic.c
/*
 * Copyright (c) 2026 Oray Inc. All rights reserved.
 * Copyright (C) 2022-2026 OraySZ / OrayOS-Team.
 *
 * This work is licensed under CC BY-NC-SA 4.0.
 * To view a copy of this license, visit:
 * https://creativecommons.org/licenses/by-nc-sa/4.0/
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *
 * File:     ch32-stk-pfic.c
 * Author:   lintel <lintel.huang@gmail.com>
 * Date:     2026-04-27
 *
 * Description:
 *     SysTick（STK @0xE000F000）与 PFIC IENR/IRER 窗口（与 EVT 向量 12 对齐）。
 */

#include "ch32-machine-internal.h"
#include "system/runstate.h"

static void ch32_stk_schedule(Ch32MachineState *m);

/* ch32_stk_schedule_wrap - 封装为匹配 resync 表函数签名的 wrapper */
static void ch32_stk_schedule_wrap(Ch32MachineState *m)
{
    ch32_stk_schedule(m);
}

/*
 * Software_IRQn = 14：
 * 须同步 MIP_MSIP 并在 WCH VTF 下映射到 EVT 字索引 14（见 target/riscv/cpu_helper.c）。
 */
#define CH32_PFIC_SW_IRQ_BIT 14u

static void ch32_pfic_sw_irq_miesync(Ch32MachineState *m)
{
    RISCVCPU *cpu = &m->cpus.harts[0];
    CPURISCVState *env = &cpu->env;

    BQL_LOCK_GUARD();
    if ((m->pfic_ienr[0] >> CH32_PFIC_SW_IRQ_BIT) & 1u) {
        env->mie |= MIP_MSIP;
    } else {
        env->mie &= ~MIP_MSIP;
        riscv_cpu_update_mip(env, MIP_MSIP, 0);
    }
    riscv_cpu_interrupt(env);
}

static void ch32_pfic_sw_irq_set_pending(Ch32MachineState *m)
{
    RISCVCPU *cpu = &m->cpus.harts[0];
    CPURISCVState *env = &cpu->env;

    if (!((m->pfic_ienr[0] >> CH32_PFIC_SW_IRQ_BIT) & 1u)) {
        return;
    }
    BQL_LOCK_GUARD();
    riscv_cpu_update_mip(env, MIP_MSIP, MIP_MSIP);
    riscv_cpu_interrupt(env);
}

/*
 * ch32_pfic_inject_meip_for_irq - 将指定 word 中 enabled 最低 IRQ 为候选，
 * 若 wch_evt_mcause_override 槽空闲则注入 MEIP。
 * 用于 NVIC_SetPendingIRQ（外设 IRQ）触发中断的通用路径。
 * 对应 EVT INT/Interrupt_Nest 示例中的 NVIC_SetPendingIRQ(WWDG_IRQn) 等。
 *
 * PFIC 真实行为：CPU 接受中断时自动清除 IPR 挂起位、置位 IACTR 激活位。
 * QEMU 近似：注入时立即 pre-clear IPR（模拟接受）。
 */
static void ch32_pfic_inject_meip_for_irq(Ch32MachineState *m,
                                           unsigned wd, uint32_t enabled)
{
    RISCVCPU *cpu = &m->cpus.harts[0];
    CPURISCVState *env = &cpu->env;
    unsigned bit   = (unsigned)__builtin_ctz(enabled);
    unsigned irq_n = wd * 32u + bit;

    BQL_LOCK_GUARD();
    if (env->wch_evt_mcause_override == 0) {
        /*
         * 模拟 PFIC 硬件接受行为：
         * 1. 清除 IPR 挂起位（CPU 进入 ISR 后硬件自动清除）
         * 2. 置位 IACTR 激活位（ISR 执行期间中断活跃）
         * mret 时由 ch32_pfic_irq_active_clear 清除 IACTR，
         * 并由 wch_vtf_exit 清除 wch_evt_mcause_override + 降低 MEIP。
         */
        m->pfic_ipr[wd] &= ~(1u << bit);
        ch32_pfic_irq_active_set(m, irq_n);
        env->mie |= MIP_MEIP;
        env->wch_evt_mcause_override = irq_n;
        riscv_cpu_update_mip(env, MIP_MEIP, MIP_MEIP);
        riscv_cpu_interrupt(env);
    }
}

static uint32_t ch32_stk_hz(const Ch32MachineState *m)
{
    /*
     * STK_CTLR.STCLK (bit 2)：
     *   1 → 直达 HCLK；0 → HCLK/8。
     * 以前这里写死为 96 MHz / 12 MHz，忽略了 RCC CFGR0 的实际配置，
     * 在固件配置 HCLK=48/72/144 MHz 时会导致 SysTick 节拍与真机偏离。
     * 现在改为向 ch32-rcc.c 索取实时 HCLK。
     */
    uint32_t hclk = ch32_rcc_get_hclk_hz(m);
    return (m->stk.ctlr & 4u) ? hclk : (hclk / 8u);
}

static uint64_t ch32_stk_now_cnt(Ch32MachineState *m)
{
    uint32_t hz = ch32_stk_hz(m);
    uint64_t ns;

    if (hz == 0) {
        return m->stk_cnt_at_epoch;
    }
    ns = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);

    if (ns < m->stk_epoch_ns) {
        return m->stk_cnt_at_epoch;
    }
    return m->stk_cnt_at_epoch + muldiv64(ns - m->stk_epoch_ns, hz, 1000000000ull);
}

static bool ch32_pfic_systick_enabled(const Ch32MachineState *m)
{
    return (m->pfic_ienr[0] >> CH32_SYSTICK_NVIC_BIT) & 1u;
}

static void ch32_stk_set_cnt(Ch32MachineState *m, uint64_t cnt)
{
    m->stk_epoch_ns = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
    m->stk_cnt_at_epoch = cnt;
}

static void ch32_stk_mtie_ensure(Ch32MachineState *m)
{
    RISCVCPU *cpu = &m->cpus.harts[0];
    CPURISCVState *env = &cpu->env;

    BQL_LOCK_GUARD();
    env->mie |= MIP_MTIP;
    riscv_cpu_interrupt(env);
}

static void ch32_stk_clear_mtip(Ch32MachineState *m)
{
    RISCVCPU *cpu = &m->cpus.harts[0];
    CPURISCVState *env = &cpu->env;

    BQL_LOCK_GUARD();
    riscv_cpu_update_mip(env, MIP_MTIP, 0);
}

void ch32_stk_tick(void *opaque)
{
    Ch32MachineState *m = opaque;
    Ch32StkState *stk = &m->stk;
    const uint64_t cmp = ((uint64_t)stk->cmph << 32) | stk->cmpl;
    /* 计数器使能：只需 STE(bit0)=1 且 CMP!=0 即可触发 CNTIF，不依赖 STIE 或 PFIC */
    const bool count_en = (stk->ctlr & 1u) && cmp != 0 && ch32_stk_hz(m) != 0;
    /* 中断使能：需要额外的 STIE(bit1) 且 PFIC 中 SysTick 中断通道已使能 */
    const bool irq_en = count_en && (stk->ctlr & 2u) && ch32_pfic_systick_enabled(m);

    if (!count_en) {
        ch32_stk_schedule(m);
        return;
    }

    /* 无论是否启用中断，计数到达 CMP 时总设置 CNTIF 标志 */
    stk->sr |= 1u;

    if (irq_en) {
        ch32_stk_mtie_ensure(m);
        {
            RISCVCPU *cpu = &m->cpus.harts[0];

            riscv_cpu_update_mip(&cpu->env, MIP_MTIP, MIP_MTIP);
        }
    }
    ch32_stk_schedule(m);
}

static void ch32_stk_schedule(Ch32MachineState *m)
{
    Ch32StkState *stk = &m->stk;
    const uint32_t hz = ch32_stk_hz(m);
    const uint64_t cmp = ((uint64_t)stk->cmph << 32) | stk->cmpl;
    /* 定时器调度只需 STE(bit0)=1 且 CMP!=0，不依赖 STIE 或 PFIC 中断使能 */
    const bool run = (stk->ctlr & 1u) && cmp != 0 && hz != 0;

    if (!m->stk_timer) {
        return;
    }
    if (!run) {
        timer_del(m->stk_timer);
        ch32_stk_clear_mtip(m);
        return;
    }

    {
        /*
         * 不论递增还是递减模式，下一次溢出的展期均为
         *   ticks_to_wrap = cmp - (elapsed_ticks % cmp)
         * 两种模式公式相同，无需分支。
         */
        uint64_t now = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
        uint64_t c   = m->stk_cnt_at_epoch +
                       muldiv64(now - m->stk_epoch_ns, hz, 1000000000ull);
        uint64_t mod  = c % cmp;
        uint64_t ticks = (mod == 0) ? cmp : (cmp - mod);
        uint64_t delay_ns = muldiv64(ticks, 1000000000ull, hz);

