lintel/qemu-ch32v/qemu-overlay/10.2.2/hw/riscv/ch32-stk-pfic.c
        timer_mod_ns(m->stk_timer, now + delay_ns);
    }
}

/* =====================================================================
 * 统一 PFIC IO handler
 *
 * 寄存器局部（base=CH32_PFIC_BASE=0xE000E000，size=0x1000）：
 *   0x000~0x01F  ISR[8]   只读  中断使能状态（=pfic_ienr）
 *   0x020~0x03F  IPR[8]   只读  中断挂起状态（=pfic_ipr）
 *   0x040        ITHRESDR 读写  中断阈值
 *   0x048        CFGR     只写  SystemReset（KEY3|bit7）
 *   0x04C        GISR     只读  全局中断状态
 *   0x050~0x053  VTFIDR   读写  VTF 中断 ID（字节粒度，4通道各 1 字节）
 *   0x060~0x06F  VTFADDR  读写  VTF 中断地址（4路，每路 4 字节）
 *   0x100~0x11F  IENR[8]  只写  中断使能（写 1 置位）
 *   0x180~0x19F  IRER[8]  只写  中断禁用（写 1 清位）
 *   0x200~0x21F  IPSR[8]  只写  中断挂起（写 1 置位）
 *   0x280~0x29F  IPRR[8]  只写  中断清挂起（写 1 清位）
 *   0x300~0x31F  IACTR[8] 只读  中断激活状态
 *   0x400~0x4FF  IPRIOR   读写  中断优先级（字节粒度）
 *   0xD10        SCTLR    读写  系统控制
 * ==================================================================== */

#define CH32_PFIC_CFGR_SYSRESET_KEY  0xBEEF0000u
#define CH32_PFIC_CFGR_SYSRESET_BIT  (1u << 7)

/*
 * PFIC VTF 寄存器：4路 VTF 通道，每路由一个 ID（VTFIDR）和一个地址（VTFADDR）组成。
 * VTFIDR@0x50~0x53: VTFIDR[0..3]，字节粒度（uint8 数组，core_riscv.h: uint8_t VTFIDR[4]）
 * VTFADDRx@0x60+4*n: [31:1]=地址, [0]=VTFxEN 使能位（core_riscv.h: uint32_t VTFADDR[4]）
 */
#define CH32_PFIC_VTF_NUM  4u

/*
 * PFIC SCTLR 偏移地址：0xD10（不是 0xE00！）
 *   bit31: SYSRST (WO) - 系统复位
 *   bit5:  SETEVENT (WO) - 设置事件
 *   bit4:  SEVONPEND (RW)
 *   bit3:  WFITOWFE (RW)
 *   bit2:  SLEEPDEEP (RW)
 *   bit1:  SLEEPONEXIT (RW)
 */
#define CH32_PFIC_SCTLR_OFF  0xD10u
#define CH32_PFIC_SCTLR_SYSRST    (1u << 31)
#define CH32_PFIC_SCTLR_SETEVENT  (1u << 5)
#define CH32_PFIC_SCTLR_SEVONPEND (1u << 4)
#define CH32_PFIC_SCTLR_WFITOWFE  (1u << 3)
#define CH32_PFIC_SCTLR_SLEEPDEEP  (1u << 2)
#define CH32_PFIC_SCTLR_SLEEPONEXIT (1u << 1)

/* IRQ bit-ranges for selective resync (word/bit within pfic_ienr[]) */
/* SW IRQ 14: word 0 bit 14 */
#define CH32_PFIC_SW_IRQ_WD       0u
#define CH32_PFIC_SW_IRQ_MASK     (1u << CH32_PFIC_SW_IRQ_BIT)
/* STK IRQ 12: word 0 bit 12 */
#define CH32_PFIC_STK_WD          0u
#define CH32_PFIC_STK_MASK        (1u << CH32_SYSTICK_NVIC_BIT)
/* USART1 IRQ 53: word 1 bit 21 */
#define CH32_PFIC_USART1_WD       1u
#define CH32_PFIC_USART1_MASK     (1u << (CH32_USART1_NVIC_IRQ % 32u))
/* USART2/3 IRQ 54/55: word 1 bit 22/23 */
#define CH32_PFIC_USART23_MASK    ((1u << (CH32_USART2_NVIC_IRQ % 32u)) | \
                                   (1u << (CH32_USART3_NVIC_IRQ % 32u)))
/* UART4~8 IRQ 68/69/87/88/89: word 2 */
#define CH32_PFIC_UART48_MASK     ((1u << (CH32_UART4_NVIC_IRQ % 32u)) | \
                                   (1u << (CH32_UART5_NVIC_IRQ % 32u)) | \
                                   (1u << (CH32_UART6_NVIC_IRQ % 32u)) | \
                                   (1u << (CH32_UART7_NVIC_IRQ % 32u)) | \
                                   (1u << (CH32_UART8_NVIC_IRQ % 32u)))
/* ETH IRQ 77: word 2 bit 13 */
#define CH32_PFIC_ETH_WD          2u
#define CH32_PFIC_ETH_MASK        (1u << (CH32_ETH_IRQ_N % 32u))
/* ETH10M IRQ 61: word 1 bit 29 (CH32V20x_D8 / ch32v203rb) */
#define CH32_PFIC_ETH10M_WD       1u
#define CH32_PFIC_ETH10M_MASK     (1u << (CH32_ETH_10M_IRQ_N % 32u))
/* TIM2~TIM7 masks */
#define CH32_PFIC_TIM2_WD         1u
#define CH32_PFIC_TIM2_MASK       (1u << (CH32_TIM2_IRQ_N % 32u))
#define CH32_PFIC_TIM3_MASK       (1u << (CH32_TIM3_IRQ_N % 32u))
#define CH32_PFIC_TIM4_MASK       (1u << (CH32_TIM4_IRQ_N % 32u))
/* TIM5/6/7: IRQ 66/70/71 in word 2 */
#define CH32_PFIC_TIM567_WD       2u
#define CH32_PFIC_TIM5_MASK       (1u << (CH32_TIM5_IRQ_N % 32u))
#define CH32_PFIC_TIM6_MASK       (1u << (CH32_TIM6_IRQ_N % 32u))
#define CH32_PFIC_TIM7_MASK       (1u << (CH32_TIM7_IRQ_N % 32u))
/* USB host IRQ 85: word 2 bit 21 */
#define CH32_PFIC_USBHOST_WD      2u
#define CH32_PFIC_USBHOST_MASK    (1u << (85u % 32u))
/* USB FS host IRQ 83: word 2 bit 19 */
#define CH32_PFIC_USBFSHOST_WD   2u
#define CH32_PFIC_USBFSHOST_MASK  (1u << (83u % 32u))
/*
 * DMA IRQ 分布（CH32V307/317 D8C 变体）：
 *   DMA1 Ch1~5 : IRQ 27~31  -> wd=0 bits 27~31
 *   DMA1 Ch6~7 : IRQ 32~33  -> wd=1 bits 0~1
 *   DMA2 Ch1~5 : IRQ 72~76  -> wd=2 bits 8~12
 *   DMA2 Ch6~7 : IRQ 98~99  -> wd=3 bits 2~3
 *   DMA2 Ch8~11: IRQ 100~103-> wd=3 bits 4~7
 */
#define CH32_PFIC_DMA_WD0_MASK    (0x1Fu << 27)              /* bits 27~31 */
#define CH32_PFIC_DMA_WD1_MASK    (0x03u)                    /* bits 0~1   */
#define CH32_PFIC_DMA_WD2_MASK    (0x1Fu << 8)               /* bits 8~12  */
#define CH32_PFIC_DMA_WD3_MASK    (0xFCu)                    /* bits 2~7   */

/*
 * ch32_pfic_resync_changed - 在 IENR/IRER 写入后，仅对 changed 中
 * 有位变化的外设调用对应 resync，减少不必要的 BQL lock 和 MIP 操作。
 *
 * 采用描述符表驱动：新增外设时只需在表中添加一条记录，无需修改函数体。
 */
typedef struct Ch32PficResyncEntry {
    unsigned wd;          /* pfic_ienr word 索引 */
    uint32_t mask;        /* 关注的 bit mask */
    void (*resync)(Ch32MachineState *m);
} Ch32PficResyncEntry;

static const Ch32PficResyncEntry pfic_resync_table[] = {
    /* word 0 外设 */
    { 0u, CH32_PFIC_SW_IRQ_MASK,  ch32_pfic_sw_irq_miesync  },
    { 0u, CH32_PFIC_STK_MASK,     ch32_stk_schedule_wrap    },
    /* word 1 外设: USART1(53)、USART2/3(54/55)、TIM2/3/4(44/45/46)、ETH10M(61) */
    { 1u, CH32_PFIC_USART1_MASK,  ch32_usart1_meip_resync   },
    { 1u, CH32_PFIC_USART23_MASK, ch32_usart_lite_meip_resync },
    { 1u, CH32_PFIC_TIM2_MASK | CH32_PFIC_TIM3_MASK | CH32_PFIC_TIM4_MASK,
                                   ch32_tim_meip_resync_all  },
    { 1u, CH32_PFIC_ETH10M_MASK,  ch32_eth_10m_meip_resync   },
    /* word 2 外设: UART4~8(68/69/87/88/89)、ETH(77)、TIM5/6/7(66/70/71)、USBHS(85)、USBFS(83) */
    { 2u, CH32_PFIC_UART48_MASK, ch32_usart_lite_meip_resync },
    { 2u, CH32_PFIC_ETH_MASK,     ch32_eth_meip_resync      },
    { 2u, CH32_PFIC_TIM5_MASK | CH32_PFIC_TIM6_MASK | CH32_PFIC_TIM7_MASK,
                                   ch32_tim_meip_resync_all  },
    { 2u, CH32_PFIC_USBHOST_MASK, ch32_usbhost_meip_resync  },
    { 2u, CH32_PFIC_USBFSHOST_MASK, ch32_usbfs_host_meip_resync },
    /* DMA1/DMA2 跨 wd0~wd3，override 繁忙时挂 pfic_ipr 软件 pending */
    { 0u, CH32_PFIC_DMA_WD0_MASK, ch32_dma_meip_resync      },
    { 1u, CH32_PFIC_DMA_WD1_MASK, ch32_dma_meip_resync      },
    { 2u, CH32_PFIC_DMA_WD2_MASK, ch32_dma_meip_resync      },
    { 3u, CH32_PFIC_DMA_WD3_MASK, ch32_dma_meip_resync      },
};

