lintel/qemu-ch32v/qemu-overlay/10.2.2/hw/riscv/ch32-stk-pfic.c
static void ch32_pfic_resync_changed(Ch32MachineState *m,
                                     unsigned wd, uint32_t changed)
{
    size_t i;

    for (i = 0; i < ARRAY_SIZE(pfic_resync_table); i++) {
        const Ch32PficResyncEntry *e = &pfic_resync_table[i];

        if (e->wd == wd && (changed & e->mask)) {
            e->resync(m);
        }
    }
}

/*
 * ch32_pfic_resync_pending_meip - 当 MEIP owner 释放后，重新扫描所有外设的中断状态。
 *
 * 遵历 pfic_resync_table 全表，顺序与表中第一个匹配项优先级一致：
 * ETH10M 在首位，保证网络包延迟最小。
 */
void ch32_pfic_resync_pending_meip(Ch32MachineState *m)
{
    size_t i;

    if (!m) {
        return;
    }
    for (i = 0; i < ARRAY_SIZE(pfic_resync_table); i++) {
        pfic_resync_table[i].resync(m);
    }
}

/*
 * ch32_pfic_irq_active_set - 在 IACTR 中标记指定 IRQ 为激活状态。
 * 当 CPU 响应中断（进入 IRQ handler）时调用。
 * 真实 PFIC 硬件在进入中断时自动置位 IACTR 对应位。
 */
void ch32_pfic_irq_active_set(Ch32MachineState *m, unsigned irq_n)
{
    unsigned wd = irq_n / 32u;
    unsigned bit = irq_n % 32u;
    if (wd < 8u) {
        m->pfic_iactr[wd] |= (1u << bit);
    }
}

/*
 * ch32_pfic_irq_active_clear - 在 IACTR 中清除指定 IRQ 的激活状态。
 * 当 mret 返回时调用（真实 PFIC 硬件在 mret 时自动清除 IACTR 位）。
 */
void ch32_pfic_irq_active_clear(Ch32MachineState *m, unsigned irq_n)
{
    unsigned wd = irq_n / 32u;
    unsigned bit = irq_n % 32u;
    if (wd < 8u) {
        m->pfic_iactr[wd] &= ~(1u << bit);
    }
}

/*
 * ch32_pfic_resync_software_pending - 扫描 pfic_ipr 中的纯软件挂起中断。
 *
 * 对于通过 NVIC_SetPendingIRQ 设置的挂起位（没有对应的外设 resync 入口），
 * 在 mret 后重新扫描并触发。
 * 排除已有 resync 条目涵盖的外设中断和系统中断（SW_IRQ / SysTick）。
 */
static void ch32_pfic_resync_software_pending(Ch32MachineState *m)
{
    RISCVCPU *cpu = &m->cpus.harts[0];
    CPURISCVState *env = &cpu->env;

    if (env->wch_evt_mcause_override != 0) {
        return; /* 已有活跨 override，不重复注入 */
    }

    /* 排除已有 resync 的外设撩码（SW_IRQ bit14 + SysTick bit24） */
#define CH32_PFIC_RESYNC_MASK_WD0 \
    ((1u << CH32_PFIC_SW_IRQ_BIT) | (1u << CH32_SYSTICK_NVIC_BIT) | \
     CH32_PFIC_DMA_WD0_MASK)
#define CH32_PFIC_RESYNC_MASK_WD1 \
    (CH32_PFIC_USART1_MASK | CH32_PFIC_USART23_MASK | CH32_PFIC_TIM2_MASK | \
     CH32_PFIC_TIM3_MASK | CH32_PFIC_TIM4_MASK | CH32_PFIC_ETH10M_MASK | \
     CH32_PFIC_DMA_WD1_MASK)
#define CH32_PFIC_RESYNC_MASK_WD2 \
    (CH32_PFIC_UART48_MASK | CH32_PFIC_ETH_MASK | CH32_PFIC_TIM5_MASK | \
     CH32_PFIC_TIM6_MASK | CH32_PFIC_TIM7_MASK | CH32_PFIC_USBHOST_MASK | \
     CH32_PFIC_USBFSHOST_MASK | \
     CH32_PFIC_DMA_WD2_MASK)
#define CH32_PFIC_RESYNC_MASK_WD3 \
    (CH32_PFIC_DMA_WD3_MASK)

    for (unsigned wd = 0; wd < 8u; wd++) {
        uint32_t ipr = m->pfic_ipr[wd] & m->pfic_ienr[wd];

        /* 排除已有 resync 涵盖的外设中断 */
        if (wd == 0u) ipr &= ~CH32_PFIC_RESYNC_MASK_WD0;
        if (wd == 1u) ipr &= ~CH32_PFIC_RESYNC_MASK_WD1;
        if (wd == 2u) ipr &= ~CH32_PFIC_RESYNC_MASK_WD2;
        if (wd == 3u) ipr &= ~CH32_PFIC_RESYNC_MASK_WD3;

        if (ipr) {
            ch32_pfic_inject_meip_for_irq(m, wd, ipr);
            return; /* 注入一个即返回 */
        }
    }
}

/*
 * ch32_pfic_on_mret - VTF mret 回调（由 op_helper.c helper_mret 调用）。
 *
 * 当 wch_vtf_in_isr 从 1 降到 0 时（最外层 ISR mret），进行：
 *  1. 清除 IACTR 中当前 IRQ 的激活位
 *  2. 清除 wch_evt_mcause_override
 *  3. 降低 MEIP
 *  4. 重新扫描外设 + 软件挂起中断，触发下一个挂起中断
 *
 * 注：这里不检查 wch_vtf_in_isr == 0，调用旹（op_helper）已经確保
 * 只在 override 非零时调用。
 */
void ch32_pfic_on_mret(CPURISCVState *env, uint32_t irq_n, void *opaque)
{
    Ch32MachineState *m = (Ch32MachineState *)opaque;

    BQL_LOCK_GUARD();
    /* 1. 清除 IACTR */
    ch32_pfic_irq_active_clear(m, irq_n);
    /* 2. 清除 override */
    env->wch_evt_mcause_override = 0;
    /* 3. 降低 MEIP */
    riscv_cpu_update_mip(env, MIP_MEIP, 0);
    /* 4. 重新扫描：先硬件外设，册软件挂起 */
    ch32_pfic_resync_pending_meip(m);
    ch32_pfic_resync_software_pending(m);
    riscv_cpu_interrupt(env);
}

/*
 * ch32_pfic_register_mret_cb - 将 mret 回调注册到 CPU env。
 * 在 machine init 时调用。
 */
void ch32_pfic_register_mret_cb(Ch32MachineState *m)
{
    CPURISCVState *env = &m->cpus.harts[0].env;
    env->wch_pfic_mret_cb  = ch32_pfic_on_mret;
    env->wch_pfic_opaque   = m;
}

static uint64_t ch32_pfic_read(void *opaque, hwaddr addr, unsigned size)
{
    Ch32MachineState *m = opaque;

    /* ISR[8]: 中断使能状态（反映 pfic_ienr） */
    if (addr < 0x020u) {
        unsigned idx = (unsigned)addr / 4u;
        uint32_t v = (idx < 8u) ? m->pfic_ienr[idx] : 0u;
        if (size == 1) return (v >> (8u * ((unsigned)addr & 3u))) & 0xffu;
        if (size == 2) return (v >> (8u * ((unsigned)addr & 2u))) & 0xffffu;
        return v;
    }
    /* IPR[8]: 中断挂起状态 */
    if (addr >= 0x020u && addr < 0x040u) {
        unsigned idx = (unsigned)(addr - 0x020u) / 4u;
        uint32_t v = (idx < 8u) ? m->pfic_ipr[idx] : 0u;
        if (size == 1) return (v >> (8u * ((unsigned)(addr - 0x020u) & 3u))) & 0xffu;
        if (size == 2) return (v >> (8u * ((unsigned)(addr - 0x020u) & 2u))) & 0xffffu;
        return v;
    }
    /* ITHRESDR@0x40: 中断优先级阈值 */
    if (addr == 0x040u) {
        return m->pfic_ithresdr;
    }
    /* GISR@0x4C: 全局中断状态寄存器 */
    if (addr == 0x04Cu) {
        uint32_t gisr = 0;
        /*
         * bit9: GPENDSTA - 是否有中断处于挂起状态
         * bit8: GACTSTA - 是否有中断正在执行
         * bit[7:0]: NESTSTA - 中断嵌套深度
         *
         * NESTSTA 编码：0x01=第1级, 0x03=第2级, 0x07=第3级, ... 0xFF=第8级
         * 在 QEMU 中，用 wch_vtf_in_isr 近似嵌套深度。
         */
        bool has_pending = false;
        bool has_active = false;
        RISCVCPU *cpu;
        CPURISCVState *env;
        unsigned nest;
        uint32_t nest_mask;
        for (unsigned i = 0; i < 8; i++) {
            if (m->pfic_ipr[i]) has_pending = true;
            if (m->pfic_iactr[i]) has_active = true;
        }
        if (has_pending) gisr |= (1u << 9);
        if (has_active)  gisr |= (1u << 8);
        /* NESTSTA: V4F 最大8级嵌套，编码为掩码 */
        cpu = &m->cpus.harts[0];
        env = &cpu->env;
        nest = env->wch_vtf_in_isr;
        if (nest > 8) nest = 8;
        nest_mask = (nest > 0) ? ((1u << nest) - 1u) : 0u;
        gisr |= (nest_mask & 0xFFu);
        return gisr;
    }
    /* VTFIDR[4]@0x50~0x53: VTF 通道 IRQ ID（字节粒度） */
    if (addr >= 0x050u && addr <= 0x053u) {
        unsigned off = (unsigned)(addr - 0x050u);
        uint32_t v32 = (uint32_t)m->pfic_vtfidr[0] |
                       ((uint32_t)m->pfic_vtfidr[1] << 8u) |
                       ((uint32_t)m->pfic_vtfidr[2] << 16u) |
                       ((uint32_t)m->pfic_vtfidr[3] << 24u);
        if (size == 1) return (v32 >> (8u * off)) & 0xffu;
        if (size == 2) return (v32 >> (8u * (off & 2u))) & 0xffffu;
        return v32;
    }
    /* VTFADDR[4]@0x60~0x6F: VTF 通道地址（uint32 数组，步长 4） */
    if (addr >= 0x060u && addr < 0x070u) {
        unsigned ch = (unsigned)(addr - 0x060u) / 4u;
        if (ch < CH32_PFIC_VTF_NUM) {
            return m->pfic_vtfaddr[ch];
        }
        return 0;
    }
    /* IACTR[8]@0x300~0x31F: 中断激活状态（只读） */
    if (addr >= 0x300u && addr < 0x320u) {
        unsigned idx = (unsigned)(addr - 0x300u) / 4u;
        uint32_t v = (idx < 8u) ? m->pfic_iactr[idx] : 0u;
        if (size == 1) return (v >> (8u * ((unsigned)(addr - 0x300u) & 3u))) & 0xffu;
        if (size == 2) return (v >> (8u * ((unsigned)(addr - 0x300u) & 2u))) & 0xffffu;
        return v;
    }
    /* IPRIOR[256]: 中断优先级（字节） */
    if (addr >= 0x400u && addr < 0x500u) {
        unsigned off = (unsigned)(addr - 0x400u);
        if (size == 1) return m->pfic_iprior[off];
        if (size == 2 && off + 1u < 256u)
            return (uint32_t)m->pfic_iprior[off] |
                   ((uint32_t)m->pfic_iprior[off + 1u] << 8u);
        if (size == 4 && off + 3u < 256u)
            return (uint32_t)m->pfic_iprior[off] |
                   ((uint32_t)m->pfic_iprior[off + 1u] << 8u) |
                   ((uint32_t)m->pfic_iprior[off + 2u] << 16u) |
                   ((uint32_t)m->pfic_iprior[off + 3u] << 24u);
        return 0;
    }
    /* SCTLR@0xD10: 系统控制寄存器 */
    if (addr == CH32_PFIC_SCTLR_OFF) {
        /* 只读位：SYSRST(31)/SETEVENT(5) 是 WO，读回 0 */
        return m->pfic_sctlr & (CH32_PFIC_SCTLR_SEVONPEND |
                                 CH32_PFIC_SCTLR_WFITOWFE |
                                 CH32_PFIC_SCTLR_SLEEPDEEP |
                                 CH32_PFIC_SCTLR_SLEEPONEXIT);
    }
    return 0;
}

static void ch32_pfic_write(void *opaque, hwaddr addr, uint64_t val,
                             unsigned size)
{
    Ch32MachineState *m = opaque;
    uint32_t v = (uint32_t)val;
    /* ITHRESDR@0x40: 中断优先级阈値 */
    if (addr == 0x040u && size == 4) {
        /* [7:0] THRESHOLD: 中断优先级阈值；[31:8] 保留 */
        m->pfic_ithresdr = v & 0xFFu;
        return;
    }
    /* CFGR@0x48: NVIC_SystemReset() 写入 KEY3|(1<<7) */
    if (addr == 0x048u) {
        if ((v & 0xFFFF0000u) == CH32_PFIC_CFGR_SYSRESET_KEY &&
            (v & CH32_PFIC_CFGR_SYSRESET_BIT)) {
            qemu_system_reset_request(SHUTDOWN_CAUSE_GUEST_RESET);
        }
        return;
    }
    /* VTFIDR[4]@0x50~0x53: VTF 通道 IRQ ID（字节粒度） */
    if (addr >= 0x050u && addr <= 0x053u) {
        unsigned off = (unsigned)(addr - 0x050u);
        if (size == 1) {
            m->pfic_vtfidr[off] = (uint8_t)v;
        } else if (size == 2 && off <= 2u) {
            m->pfic_vtfidr[off]     = (uint8_t)v;
            m->pfic_vtfidr[off + 1] = (uint8_t)(v >> 8u);
        } else if (size == 4 && off == 0) {
            m->pfic_vtfidr[0] = (uint8_t)v;
            m->pfic_vtfidr[1] = (uint8_t)(v >> 8u);
            m->pfic_vtfidr[2] = (uint8_t)(v >> 16u);
            m->pfic_vtfidr[3] = (uint8_t)(v >> 24u);
        }
        return;
    }
    /* VTFADDR[4]@0x60~0x6F: VTF 通道地址（uint32 数组，步长 4） */
    if (addr >= 0x060u && addr < 0x070u) {
        unsigned ch = (unsigned)(addr - 0x060u) / 4u;
        if (ch < CH32_PFIC_VTF_NUM && size == 4) {
            m->pfic_vtfaddr[ch] = v;
            return;
        }
    }
    /* IENR[8]@0x100~0x11F: 中断使能（写 1 置位） */
    if (addr >= 0x100u && addr < 0x120u && size == 4 && !(addr & 3u)) {
        unsigned idx = (unsigned)(addr - 0x100u) / 4u;
        uint32_t old = m->pfic_ienr[idx];
        m->pfic_ienr[idx] |= v;
        ch32_pfic_resync_changed(m, idx, m->pfic_ienr[idx] ^ old);
        return;
    }
    /* IRER[8]@0x180~0x19F: 中断禁用（写 1 清位） */
    if (addr >= 0x180u && addr < 0x1a0u && size == 4 && !(addr & 3u)) {
        unsigned idx = (unsigned)(addr - 0x180u) / 4u;
        uint32_t old = m->pfic_ienr[idx];
        m->pfic_ienr[idx] &= ~v;
        ch32_pfic_resync_changed(m, idx, m->pfic_ienr[idx] ^ old);
        return;
    }
    /* IPSR[8]@0x200~0x21F: 中断挂起（写 1 置位） */
    if (addr >= 0x200u && addr < 0x220u && size == 4 && !(addr & 3u)) {
        unsigned idx = (unsigned)(addr - 0x200u) / 4u;
        uint32_t enabled;
        m->pfic_ipr[idx] |= v;
        /*
         * Software_IRQn=14 需要额外触发 MSIP（RISC-V 软中断通道）。
         * 其他外设 IRQ 都进入通用 MEIP 路径。
         */
        if (idx == 0u && (v & (1u << CH32_PFIC_SW_IRQ_BIT))) {
            ch32_pfic_sw_irq_set_pending(m);
        }
        /* 通用路径：若有 IENR 已使能的非-Software bit，注入 MEIP
         * 对应 Interrupt_Nest 示例： NVIC_SetPendingIRQ(WWDG_IRQn/PVD_IRQn/...) */
        enabled = m->pfic_ienr[idx] & v;
        /* 排除 Software_IRQn=14（已由 MSIP 处理） */
        if (idx == 0u) {
            enabled &= ~(1u << CH32_PFIC_SW_IRQ_BIT);
        }
        if (enabled) {
            ch32_pfic_inject_meip_for_irq(m, idx, enabled);
        }
        return;
    }
    /* IPRR[8]@0x280~0x29F: 中断清挂起（写 1 清位） */
    if (addr >= 0x280u && addr < 0x2a0u && size == 4 && !(addr & 3u)) {
        unsigned idx = (unsigned)(addr - 0x280u) / 4u;
        m->pfic_ipr[idx] &= ~v;
        if (idx == 0u && (v & (1u << CH32_PFIC_SW_IRQ_BIT))) {
            RISCVCPU *cpu = &m->cpus.harts[0];
            CPURISCVState *env = &cpu->env;

            BQL_LOCK_GUARD();
            riscv_cpu_update_mip(env, MIP_MSIP, 0);
            riscv_cpu_interrupt(env);
        }
        return;
    }
    /* IPRIOR[256]@0x400~0x4FF: 中断优先级（支持字节/半字/字写入） */
    if (addr >= 0x400u && addr < 0x500u) {
        unsigned off = (unsigned)(addr - 0x400u);
        if (size == 1) {
            m->pfic_iprior[off] = (uint8_t)v;
        } else if (size == 2 && off + 1u < 256u) {
            m->pfic_iprior[off]     = (uint8_t)v;
            m->pfic_iprior[off + 1] = (uint8_t)(v >> 8u);
        } else if (size == 4 && off + 3u < 256u) {
            m->pfic_iprior[off]     = (uint8_t)v;
            m->pfic_iprior[off + 1] = (uint8_t)(v >> 8u);
            m->pfic_iprior[off + 2] = (uint8_t)(v >> 16u);
            m->pfic_iprior[off + 3] = (uint8_t)(v >> 24u);
        }
        return;
    }
    /* SCTLR@0xD10: 系统控制寄存器 */
    if (addr == CH32_PFIC_SCTLR_OFF) {
        /* SYSRST(bit31): WO, 系统复位 */
        if (v & CH32_PFIC_SCTLR_SYSRST) {
            qemu_system_reset_request(SHUTDOWN_CAUSE_GUEST_RESET);
            return;
        }
        /* SETEVENT(bit5): WO, 设置事件，不存储 */
        /* RW 位: SEVONPEND(4), WFITOWFE(3), SLEEPDEEP(2), SLEEPONEXIT(1) */
        m->pfic_sctlr = v & (CH32_PFIC_SCTLR_SEVONPEND |
                              CH32_PFIC_SCTLR_WFITOWFE |
                              CH32_PFIC_SCTLR_SLEEPDEEP |
                              CH32_PFIC_SCTLR_SLEEPONEXIT);
        return;
    }
    /* 其余未实现寄存器：silently ignore */
    (void)m;
}

const MemoryRegionOps ch32_pfic_ops = {
    .read      = ch32_pfic_read,
    .write     = ch32_pfic_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = {
        .min_access_size = 1,
        .max_access_size = 4,
    },
    .impl = {
        .min_access_size = 1,
        .max_access_size = 4,
    },
};

static uint64_t ch32_stk_read(void *opaque, hwaddr addr, unsigned size)
{
    Ch32MachineState *m = opaque;
    Ch32StkState *stk = &m->stk;
    uint64_t ticks = ch32_stk_now_cnt(m);
    uint32_t v;

    switch (addr) {
    case 0x00:
        v = stk->ctlr;
        break;
    case 0x04:
        v = stk->sr;
        break;
    case 0x08:
        v = (uint32_t)ticks;
        break;
    case 0x0c:
        v = (uint32_t)(ticks >> 32);
        break;
    case 0x10:
        v = stk->cmpl;
        break;
    case 0x14:
        v = stk->cmph;
        break;
    default:
        return 0;
    }
    if (size == 1) {
        return v & 0xff;
    }
    if (size == 2) {
        return v & 0xffff;
    }
    if (size == 4) {
        return v;
    }
    return 0;
}

static void ch32_stk_write(void *opaque, hwaddr addr, uint64_t val, unsigned size)
{
    Ch32MachineState *m = opaque;
    Ch32StkState *stk = &m->stk;

