lintel/qemu-ch32v/qemu-overlay/10.2.2/hw/riscv/ch32-stk-pfic.c
    if (size != 4) {
        return;
    }
    switch (addr) {
    case 0x00:
        /*
         * STK CTLR bit31 = SWTRG（Software Trigger）：写 1 触发 SW_Handler（Software_IRQn=14）。
         * RT-Thread 的 sw_setpend() 通过此位触发任务切换软件中断；
         * sw_clearpend() 将 bit31 清零（左移1去 bit31 再写回）来取消挂起。
         * 注意：SWTRG 位本身不保存在 ctlr（写 1 触发一次性事件，读回为 0）。
         */
        if ((uint32_t)val & (1u << 31)) {
            ch32_pfic_sw_irq_set_pending(m);
        }
        stk->ctlr = (uint32_t)val & ~(1u << 31);  /* 不保存 SWTRG 位 */
        /*
         * STK CTLR bit5 = INIT: 写 1 时重载 CNT（一次性操作，硬件不保留该位）。
         * 递减模式（bit4=1）下：CNT 被重置为 CMP（即从 CMP 向下计数）。
         * 递增模式（bit4=0）下：CNT 被重置为 0。
         * 两种情况下均重新锤定 epoch 。
         */
        if ((uint32_t)val & (1u << 5)) {
            ch32_stk_set_cnt(m, 0);
            stk->ctlr &= ~(1u << 5);  /* INIT 写 1 后清零（模拟硬件行为） */
        }
        ch32_stk_schedule(m);
        break;
    case 0x04:
        stk->sr = (uint32_t)val;
        if ((stk->sr & 1u) == 0) {
            ch32_stk_clear_mtip(m);
        }
        ch32_stk_schedule(m);
        break;
    case 0x08:
        ch32_stk_set_cnt(m, (uint64_t)(uint32_t)val);
        ch32_stk_schedule(m);
        break;
    case 0x0c:
        ch32_stk_set_cnt(m, (ch32_stk_now_cnt(m) & 0xffffffffull) |
                         ((uint64_t)(uint32_t)val << 32));
        ch32_stk_schedule(m);
        break;
    case 0x10:
        stk->cmpl = (uint32_t)val;
        ch32_stk_schedule(m);
        break;
    case 0x14:
        stk->cmph = (uint32_t)val;
        ch32_stk_schedule(m);
        break;
    default:
        break;
    }
}

/*
 * ch32_stk_pfic_reset - guest reset 时调用（ch32-v.c 的 machine reset 回调）。
 * 清零 pfic_ienr/STK 寄存器、停止 stk_timer、撤销 MTIP/MSIP，使复位后
 * SysTick 不会在 mscratch 尚未初始化时立即重新触发。
 */
void ch32_stk_pfic_reset(Ch32MachineState *m)
{
    RISCVCPU *cpu = &m->cpus.harts[0];
    CPURISCVState *env = &cpu->env;

    /* 停止 SysTick 定时器 */
    if (m->stk_timer) {
        timer_del(m->stk_timer);
    }
    /* 清零 STK 寄存器 */
    memset(&m->stk, 0, sizeof(m->stk));
    m->stk_epoch_ns = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
    m->stk_cnt_at_epoch = 0;

    /* 清零 pfic_ienr（使能寄存器）、pfic_ipr（挂起）、pfic_iactr（激活）、pfic_iprior（优先级），撤销 MTIP/MSIP */
    memset(m->pfic_ienr, 0, sizeof(m->pfic_ienr));
    /*
     * NMI（IRQ 2）和 Exception（IRQ 3）在 WCH PFIC 中始终使能（硬件不可关闭）。
     * reset 后预置 bit2+bit3 保持与真机 ISR G0=0x0000500c 一致。
     */
    m->pfic_ienr[0] |= (1u << 2) | (1u << 3);
    memset(m->pfic_ipr, 0, sizeof(m->pfic_ipr));
    memset(m->pfic_iactr, 0, sizeof(m->pfic_iactr));
    memset(m->pfic_iprior, 0, sizeof(m->pfic_iprior));
    m->pfic_ithresdr = 0;
    m->pfic_sctlr = 0;
    memset(m->pfic_vtfidr, 0, sizeof(m->pfic_vtfidr));
    memset(m->pfic_vtfaddr, 0, sizeof(m->pfic_vtfaddr));
    {
        BQL_LOCK_GUARD();
        riscv_cpu_update_mip(env, MIP_MTIP | MIP_MSIP, 0);
        env->mie &= ~(MIP_MTIP | MIP_MSIP);
        riscv_cpu_interrupt(env);
    }
}

/*
 * ch32_stk_rcc_clock_changed - RCC 写 CFGR0 导致 HCLK 改变时的重锚钩子。
 * 步骤：
 *   1. 以旧频率读出当前 SysTick 逻辑 CNT。
 *   2. 将该 CNT 作为新 epoch 的起点（epoch_ns = 现在，cnt_at_epoch = 旧频率 CNT）。
 *   3. ch32_stk_schedule 会按新频率重算到 CMP 的时延。
 * 防止频率跳变后 CNT 突变近 8 倍引起固件时间乱跳。
 */
void ch32_stk_rcc_clock_changed(Ch32MachineState *m)
{
    uint64_t cnt;

    if (!m) {
        return;
    }
    cnt = ch32_stk_now_cnt(m);
    ch32_stk_set_cnt(m, cnt);
    ch32_stk_schedule(m);
}

const MemoryRegionOps ch32_stk_ops = {
    .read = ch32_stk_read,
    .write = ch32_stk_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = {
        .min_access_size = 1,
        .max_access_size = 4,
    },
};
